//=======================================================================
//
//	模块:	JSON 数据的生成和解析
//	
//	版本:	1.00
//
//	日期:	2015-12-16
//
//	作者:	施探宇
//
//	说明:	解析和生成
//
//=======================================================================

#include "xjson.h"

#ifdef SUPPORT_XJSON

//=======================================================================
//	函数: 	json_test
//	参数:
//	返回:
//	说明:	输出为字符串
//=======================================================================
void json_test(void)
{
	jobject js;

	json_init(&js);

//	json_parser(&js,"{'bool':true,'num':1234,'text':'string','object':{'sub1':0,'sub2':true},'array':[1,2,3,4,5]}");

	json_parser(&js,"{'b':true,'n':1234,'t':'str','obj':{'sub1':0,'sub2':true,'a':[4,3,2,1]},'array':[1,2,3,'test',5]}");

	json_dump(&js);
}

#endif

